# 1. Дан двумерный список чисел. Подсчитать сумму нечетных чисел в каждой строке

a = [[1, 2, 3, 4, 5, 6],
     [10, 21, 13, 14, 52, 63, 34],
     [2],
     [3, 2, 6],
     [35, 47],
     [-3, -2, -1, 0, 1, 2, 3, 4, 5, 6],
     [100, 200, 300, 400, 500, 600]]
for line in a:
    s = 0
    for ch in line:
        if ch % 2 != 0:
            s += ch
    print(s)
